#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
null_resource.dependencies_layer: Refreshing state... [id=5820910839112050069]
data.archive_file.lambda_zip: Reading...
random_string.random: Refreshing state... [id=sZHL]
data.archive_file.lambda_zip: Read complete after 0s [id=dfbb58116cc18ec285bf84abe4b511917b9ea314]
aws_cloudwatch_log_group.api_gw: Refreshing state... [id=/aws/api_gw/pastebin-sZHL]
aws_lambda_layer_version.dependencies_layer: Refreshing state... [id=arn:aws:lambda:ca-central-1:825203715370:layer:python-layer:6]
aws_dynamodb_table.paste: Refreshing state... [id=paste]
aws_apigatewayv2_api.http_lambda: Refreshing state... [id=exj5m66tib]
aws_iam_policy.lambda_exec_role: Refreshing state... [id=arn:aws:iam::825203715370:policy/lambda-tf-pattern-ddb-post]
aws_sns_topic.budget_notification: Refreshing state... [id=arn:aws:sns:ca-central-1:825203715370:BudgetNotificationTopic]
aws_cloudwatch_log_group.lambda_logs: Refreshing state... [id=/aws/lambda/pastebin-sZHL]
aws_iam_role.lambda_exec: Refreshing state... [id=LambdaDdbPost]
aws_s3_bucket.lambda_bucket: Refreshing state... [id=pastebin20231223003519593600000001]
aws_iam_role_policy_attachment.lambda_policy: Refreshing state... [id=LambdaDdbPost-20231223010623714500000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # aws_lambda_layer_version.dependencies_layer must be replaced
-/+ resource "aws_lambda_layer_version" "dependencies_layer" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:825203715370:layer:python-layer:6" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2024-02-01T00:18:15.920+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:825203715370:layer:python-layer:6" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:825203715370:layer:python-layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "h4CEGF+rGZG0C+cdnIo5FUCt5VEPfqQbg1Zdoqhs5pU=" -> "OuCKquuiuDnoGU0xln/UUcczDSwvC6eklk0rQQKq+AI=" # forces replacement
      ~ source_code_size            = 17002690 -> (known after apply)
      ~ version                     = "6" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```

</details>

*Pushed by: @socraticDevBlog, Action: `pull_request`*